[
  {
    "title": "Week 14",
    "week": "Week 14",
    "date": "Monday, Dec. 10",
    "time": "5:15 p.m.",
    "tv": "ESPN",
    "location": "CenturyLink Field",
    "finalwinner": "Seahawks",
    "finalloser": "vs. Vikings",
    "ot": "",
    "condottascore": "23-19 Seahawks",
    "condottacommentary": "This may be the last real hurdle to getting into the playoffs for Seattle, which has already defeated Green Bay and Carolina in games with heavy postseason implications over the last three weeks. So why stop there? The Vikings have one of the best defenses in the NFL and a quarterback who won at CenturyLink last season (Kirk Cousins with Washington). But the Seahawks just keep seeming to find a way and here's thinking they will again.",
    "condottaclosest": "",
    "vorelscore": "23-20 Seahawks",
    "vorelcommentary": "Everything seems to be going right for the Seahawks (besides the fact that they've allowed an average of 330 passing yards and 70.7 percent completions in their last four games). The Vikings will move the ball, but the Seahawks will take it away, too. The Seattle offense also seems to be hitting on all cylinders at just the right time. The Seahawks will take another step towards a playoff berth with a hard-fought home win.",
    "vorelclosest": "",
    "stonescore": "24-20 Seahawks",
    "stonecommentary": "If Seattle wins this game, its playoff outlook move into the realm of virtual lock. But it won’t be easy, because the Vikings are also fighting for their playoff lives. Minnesota has lost its last two road games, while Seattle seems to be finding its groove with three straight victories. It won’t be easy against a stout defense, but the Seahawks should sneak by the Vikings.",
    "stoneclosest": "",
    "calkinsscore": "21-17 Seahawks",
    "calkinscommentary": "Seattle’s running game continues to flourish and will again Monday vs. Minnesota. Look for the Seahawks to control the clock and all but seal their playoff hopes.",
    "calkinsclosest": "",
    "celebscore": "34-28 Seahawks",
    "celebcommentary": "It’s going to be 34-28, a real nail biter with the final score coming in the last minute when Jon Ryan parachutes in and throws a TD pass.",
    "celebname": "Sarah Colonna",
    "celebbio": "Stand-up comedian and the wife of former Seahawks punter Jon Ryan",
    "celebclosest": ""
  },
  {
    "title": "Week 15",
    "week": "Week 15",
    "date": "Sunday, Dec. 16",
    "time": "1:05 p.m.",
    "tv": "FOX",
    "location": "San Francisco",
    "finalwinner": "Seahawks",
    "finalloser": "vs. 49ers",
    "ot": "",
    "condottascore": "",
    "condottacommentary": "",
    "condottaclosest": "",
    "vorelscore": "",
    "vorelcommentary": "",
    "vorelclosest": "",
    "stonescore": "",
    "stonecommentary": "",
    "stoneclosest": "",
    "calkinsscore": "",
    "calkinscommentary": "",
    "calkinsclosest": "",
    "celebscore": "",
    "celebcommentary": "",
    "celebname": "",
    "celebbio": "",
    "celebclosest": ""
  },
  {
    "title": "Week 16",
    "week": "Week 16",
    "date": "Sunday, Dec. 23",
    "time": "5:20 p.m.",
    "tv": "NBC",
    "location": "CenturyLink Field",
    "finalwinner": "Seahawks",
    "finalloser": "vs. Chiefs",
    "ot": "",
    "condottascore": "",
    "condottacommentary": "",
    "condottaclosest": "",
    "vorelscore": "",
    "vorelcommentary": "",
    "vorelclosest": "",
    "stonescore": "",
    "stonecommentary": "",
    "stoneclosest": "",
    "calkinsscore": "",
    "calkinscommentary": "",
    "calkinsclosest": "",
    "celebscore": "",
    "celebcommentary": "",
    "celebname": "",
    "celebbio": "",
    "celebclosest": ""
  },
  {
    "title": "Week 17",
    "week": "Week 17",
    "date": "Sunday, Dec. 30",
    "time": "1:25 p.m.",
    "tv": "FOX",
    "location": "CenturyLink Field",
    "finalwinner": "Seahawks",
    "finalloser": "vs. Cardinals",
    "ot": "",
    "condottascore": "",
    "condottacommentary": "",
    "condottaclosest": "",
    "vorelscore": "",
    "vorelcommentary": "",
    "vorelclosest": "",
    "stonescore": "",
    "stonecommentary": "",
    "stoneclosest": "",
    "calkinsscore": "",
    "calkinscommentary": "",
    "calkinsclosest": "",
    "celebscore": "",
    "celebcommentary": "",
    "celebname": "",
    "celebbio": "",
    "celebclosest": ""
  },
  {
    "title": "Week 1",
    "week": "Week 1",
    "date": "Sunday, Sept. 9",
    "time": "1:25 p.m.",
    "tv": "FOX",
    "location": "Denver",
    "finalwinner": "Broncos 27",
    "finalloser": "Seahawks 24",
    "ot": "",
    "condottascore": "23-21 Seahawks",
    "condottacommentary": "Two teams hoping for bounce back seasons with lots of question marks and lots reasons for their fan bases to wonder what they’re going to see on Sunday. The difference here is at QB: Russell Wilson, who seems primed for one of his best seasons, vs. Case Keenum, playing his first game with a new team.",
    "condottaclosest": "",
    "vorelscore": "24-20 Broncos",
    "vorelcommentary": "Denver is 27-4 in September home games since 2002. That trend will continue on Sunday, when the Broncos’ pass rush will disrupt Russell Wilson and the Seahawk secondary will be tested as well.",
    "vorelclosest": "x",
    "stonescore": "24-20 Broncos",
    "stonecommentary": "It’s been a long time since so much mystery surrounded the Seahawks, as a result of major off-season reconstruction. The success of their reboot won’t reveal itself in one day, but for this one, it seems too much to ask to beat the Broncos in Denver, where they almost never lose a home opener.",
    "stoneclosest": "x",
    "calkinsscore": "17-14 Broncos",
    "calkinscommentary": "Right now the burden of proof is on the Seahawks to show they can score points. The proof isn't there yet. The defense will be stingy enough to keep Seattle in the game, but the offense won't have enough to snatch a victory in Denver.",
    "calkinsclosest": "",
    "celebscore": "24-17 Seahawks",
    "celebcommentary": "I’m kinda outta the loop. That’s my guestimation, just because of the Seahawks’ history with Russell Wilson’s firepower, he’s normally able to put out 24-30 points a game, I’m interested to see how they do this season. Also for Denver, they’re struggling and rebuilding and I feel like they won’t be able to pull it off.",
    "celebname": "Edouardo Jordan",
    "celebbio": "James Beard-award winning chef and owner of JuneBaby and Salare",
    "celebclosest": ""
  },
  {
    "title": "Week 2",
    "week": "Week 2",
    "date": "Monday, Sept. 17",
    "time": "5:15 p.m.",
    "tv": "ESPN",
    "location": "Chicago",
    "finalwinner": "Bears 24",
    "finalloser": "Seahawks 17",
    "ot": "",
    "condottascore": "24-16 Bears",
    "condottacommentary": "I picked the Seahawks last week thinking the edge at quarterback would override any of the advantages Denver might have. But all the injuries to key guys as well as a second straight road game with a young team still finding its way — and in a tough venue on a Monday night — seems like a lot to overcome.",
    "condottaclosest": "x",
    "vorelscore": "24-23 Bears",
    "vorelcommentary": "The Seahawks struggled to stop the run late in last weekend’s loss at Denver, while the Bears racked up 139 rushing yards and 5.1 yards per carry in their season-opening loss to Green Bay. Now add the fact that defensive end Von Miller produced three of Denver’s six sacks last weekend, and Chicago touts an equally destructive pass-rusher in Khalil Mack. If Seattle can’t establish the run (and stop the run) Pete Carroll’s team will fall to 0-2 for the first time since 2015.",
    "vorelclosest": "",
    "stonescore": "20-17 Seahawks",
    "stonecommentary": "The Seahawks had their coming-out game under Russell Wilson at Soldier Field in 2012, and they’ll eke out a much-needed win there this year. But they’ll have to figure out a way to stop Khalil Mack better than they did Von Miller.",
    "stoneclosest": "",
    "calkinsscore": "14-10 Bears",
    "calkinscommentary": "I’d have picked the Seahawks during the preseason but the addition of Khalil Mack for Chicago makes it different. He’s a game-changer, and in this case a prediction-changer, as he’ll wreak havoc on an already tenuous Seattle offense.",
    "calkinsclosest": "",
    "celebscore": "21-14 Seahawks",
    "celebcommentary": "Chicago defense looks really, really good, but the offense is struggling a little bit. I think our quarterback is missing his cues a little bit. With the Seahawks, I've always been a little concerned about their O-line. The game is in Chicago, but I'm going to roll with the Seahawks. I'll say 21-14.",
    "celebname": "Jewell Loyd",
    "celebbio": "A native of Lincolnwood, Ill., Loyd just helped the Seattle Storm win the 2018 WNBA championship.",
    "celebclosest": ""
  },
  {
    "title": "Week 3",
    "week": "Week 3",
    "date": "Sunday, Sept. 23",
    "time": "1:25 p.m.",
    "tv": "FOX",
    "location": "CenturyLink Field",
    "finalwinner": "Seahawks 24",
    "finalloser": "Cowboys 13",
    "ot": "",
    "condottascore": "23-20 Seahawks",
    "condottacommentary": "The Seahawks are in true desperation mode as they play their home opener. Dallas' defense is statistically one of the best in the NFL through two games so there could be some ugly moments for the offense. But the thought here is that Seattle can win this game with defense (Dallas' passing attack has been anemic so far) and special teams (maybe a Michael Dickson punt or two that flips the field) and keep hope alive for another week.",
    "condottaclosest": "x",
    "vorelscore": "21-20 Seahawks",
    "vorelcommentary": "Bobby Wagner is back and the Seahawks are finally returning to CenturyLink Field. But is that enough for Seattle to secure its first victory of the season? I think the defense will gain some confidence against a one-dimensional Cowboys attack with a very limited passing game, and Russell Wilson will respond after stumbling in the loss at Chicago last week. Dallas' defense is formidable, but the Seahawks will do just enough to win the game.",
    "vorelclosest": "",
    "stonescore": "27-20 Seahawks",
    "stonecommentary": "The Seahawks return home, they get Bobby Wagner and others back off injury, and they will – or at least should – play with the urgency of knowing their season is essentially on the line. Put it together, and it adds up to a vital victory.",
    "stoneclosest": "",
    "calkinsscore": "13-10 Cowboys",
    "calkinscommentary": "Bobby Wagner and K.J. Wright returning would provide a much-needed boost for Seattle's defense, but this team just hasn't showed enough offensively through two games to convince me they can win. Expect Dallas to come out on top in a close one.",
    "calkinsclosest": "",
    "celebscore": "24-21 Seahawks",
    "celebcommentary": "It’s going to be a battle between two of the more mobile QBs in the league. Let’s hope our D-line can find some momentum and be quick to put the pressure on Dak Prescott to force some early turnovers.",
    "celebname": "Jeremy Taiwo",
    "celebbio": "2016 Olympian, Team USA and UW decathlete, Renton native",
    "celebclosest": ""
  },
  {
    "title": "Week 4",
    "week": "Week 4",
    "date": "Sunday, Sept. 30",
    "time": "1:05 p.m.",
    "tv": "FOX",
    "location": "Glendale, Ariz.",
    "finalwinner": "Seahawks 20",
    "finalloser": "Cardinals 17",
    "ot": "",
    "condottascore": "16-3 Seahawks",
    "condottacommentary": "This could be an ugly game featuring two pretty good defenses and what statistically are two of the worst offenses in the NFL; Seattle ranked 27th this week and Arizona dead last. But one team has one of the better QBs in the NFL and the other is starting a rookie who has never started a game before. That should be enough right there to push the game Seattle's way.",
    "condottaclosest": "",
    "vorelscore": "20-10 Seahawks",
    "vorelcommentary": "The Josh Rosen Era begins on Sunday, when a rookie quarterback will take the reins of the worst statistical offense in the NFL. The Seahawks have their own issues as well, but their defense has been opportunistic, with eight takeaways in their first three games. The Seahawks’ offense won’t be prolific, but Russell Wilson will do just enough to win and the Seahawks’ defense will consistently keep Rosen and running back David Johnson off balance.",
    "vorelclosest": "x",
    "stonescore": "30-7 Seahawks",
    "stonecommentary": "When you’re facing the team that’s winless, last in total offense and 25th in total defense, and, oh yeah, is also breaking in a first-time starter at quarterback, it’s a recipe for a rare comfortable victory. The Seahawks almost always do well in the desert (emphasis on “almost”) and this will add to the positive side of the ledger.",
    "stoneclosest": "",
    "calkinsscore": "21-14 Seahawks",
    "calkinscommentary": "Though rookie quarterback Josh Rosen is a wildcard, the Cardinals simply don’t have enough firepower to beat Seattle, even if they are at home. This one won’t be pretty, but it should go the Seahawks’ way.",
    "calkinsclosest": "",
    "celebscore": "24-13 Seahawks",
    "celebcommentary": "Bouncing off our first complete game of the season, we 12’s are gonna see more of the same. Arizona’s Josh Rosen is making his first start against a Hawks defense that is playing better than certainly I’d expected. (We still have best safety in the NFL, Earl Thomas, right? Sign the man, now.) Bobby Wagner and Frank Clark are coming hard and our secondary is gonna be champing at the bit. Welcome to the league, Mr. Rosen. I like our fellas getting their first road, and divisional win of the year.",
    "celebname": "Jeffrey Dean Morgan",
    "celebbio": "Seattle native, actor, The Walking Dead",
    "celebclosest": ""
  },
  {
    "title": "Week 5",
    "week": "Week 5",
    "date": "Sunday, Oct. 7",
    "time": "1:25 p.m.",
    "tv": "FOX",
    "location": "CenturyLink Field",
    "finalwinner": "Rams 33",
    "finalloser": "Seahawks 31",
    "ot": "",
    "condottascore": "33-17 Rams",
    "condottacommentary": "Seattle's always had problems with the Rams during the Russell Wilson era even in the best of times. These are hardly those, as the Rams look like one of the two best teams in the NFL while Seattle appears a middle-of-the-road club that now has to venture through the rest of the season without one of its two best defensive players. Seattle couldn't have picked a worse matchup to begin the post-Earl Thomas era.",
    "condottaclosest": "",
    "vorelscore": "37-20 Rams",
    "vorelcommentary": "So here’s the deal: Rams quarterback Jared Goff earned a perfect passer rating last week, throwing for 465 yards with five touchdowns and zero interceptions. Running back Todd Gurley II has the second-most rushing yards and rushing touchdowns in the NFL. Three Rams receivers are averaging at least 80 receiving yards per game. Now add that to the fact that the Seahawks’ defense is down both Earl Thomas and Mychal Kendricks. The Seahawks aren’t winning this one.",
    "vorelclosest": "",
    "stonescore": "30-17 Rams",
    "stonecommentary": "The last time the Rams came to town, the Seahawks were on the bad end of a 42-7 debacle. It won’t be so lopsided this time, but L.A. simply has too many weapons on both sides of the ball. In fact, the balance of power in the NFC West has officially swung from Seattle to Los Angeles, and this game will provide further proof.",
    "stoneclosest": "",
    "calkinsscore": "35-14 Rams",
    "calkinscommentary": "Motivated by the loss of Earl Thomas and the entire sports world doubting them, the Seahawks will rally behind an epic defensive performance and a spectacular 2-minute drill at the end of the game. Kidding.",
    "calkinsclosest": "",
    "celebscore": "35-23 Rams",
    "celebcommentary": "I think the Rams are gonna win this game, just by how much, that’s the key. I’m a Seahawks fan but I got to keep it real. I hope I’m wrong on this!",
    "celebname": "Sir Mix-A-Lot",
    "celebbio": "Given name: Anthony Ray, hip-hop star, rapper and Auburn native",
    "celebclosest": "x"
  },
  {
    "title": "Week 6",
    "week": "Week 6",
    "date": "Sunday, Oct. 14",
    "time": "10 a.m.",
    "tv": "FOX",
    "location": "London",
    "finalwinner": "Seahawks 27",
    "finalloser": "Raiders 3",
    "ot": "",
    "condottascore": "27-21 Seahawks",
    "condottacommentary": "Beating the Raiders in London figures to be easier than it would have been to beat them in Oakland. Especially if Seattle remembers to pack the running game that was so effective last week for the trip overseas. Oakland's passing game could cause problems, as will that Marshawn Lynch guy. But the Seahawks appear to be re-establishing their identity and if they play as they did last week against the Rams, that should be enough to get a win against the Raiders.",
    "condottaclosest": "",
    "vorelscore": "27-17 Seahawks",
    "vorelcommentary": "The Seahawks have rushed for an average of 158 yards in their last three games. The Raiders rank 28th in the NFL in rushing defense and 27th in opponent yards per carry. Chris Carson and Mike Davis will keep rolling in London and Seattle’s opportunistic defense will take advantage of Raiders quarterback Derek Carr, who has thrown eight interceptions in five games. Marshawn Lynch will wreak havoc, but it won’t be enough. Chalk up a win for the Seahawks in their first game at Wembley Stadium.",
    "vorelclosest": "",
    "stonescore": "30-20 Seahawks",
    "stonecommentary": "Oakland’s lone win was in overtime over the Browns, so this isn’t exactly a powerhouse we’re talking about. Jon Gruden has some nice pieces to work with, but his return to coaching has been less than a triumph. Coming off a confidence-inducing loss to the Rams, the Seahawks should coast in this one.",
    "stoneclosest": "",
    "calkinsscore": "21-17 Raiders",
    "calkinscommentary": "Based on the Raiders' struggles, and the fact that Seattle nearly beat the Rams last week thanks to a bruising, effective running game, the Seahawks seem like the obvious favorites. But here's what I've learned: The NFL doesn't make sense. I predict Derek Carr having his best game of the season and Marshawn Lynch reminding his old teammates of how special he was by rushing for over 100 meters in London.",
    "calkinsclosest": "",
    "celebscore": "21-7 Seahawks",
    "celebcommentary": "The Seahawks have the better record.",
    "celebname": "Jocelyne Lamoureux-Davidson",
    "celebbio": "Olympic gold medal-winning ice hockey player",
    "celebclosest": "x"
  },
  {
    "title": "Week 8",
    "week": "Week 8",
    "date": "Sunday, Oct. 28",
    "time": "10 a.m.",
    "tv": "FOX",
    "location": "Detroit",
    "finalwinner": "Seahawks 28",
    "finalloser": "Lions 14",
    "ot": "",
    "condottascore": "21-16 Lions",
    "condottacommentary": "This looks like one of the toughest games of the NFL weekend to make a call on, both teams playing well of late, each having won three of the last four. Detroit, though, has beaten some pretty good teams in the Patriots, Packers and Dolphins, sandwiched around a close loss at Dallas. And the Lions look like a suddenly well-rounded team averaging 4.9 yards per carry on the ground. The home crowd may make the difference in this one.",
    "condottaclosest": "",
    "vorelscore": "24-20 Seahawks",
    "vorelcommentary": "These teams are very similar on paper. Both are 3-3, both have won three of their last four and both feature impressive running games. But Seattle is also the healthiest it has been all season, and the return of K.J. Wright will provide an added boost. The offense will establish the run, the defense will force a turnover or two and the Seahawks will leave Detroit with a narrow victory.",
    "vorelclosest": "",
    "stonescore": "24-20 Lions",
    "stonecommentary": "This is a huge game for the Seahawks, considering how tough their schedule is about to get. But this is a difficult one in its own right. The Lions own wins over the Patriots, Packers and Dolphins, and they’re at home. Detroit has been vulnerable to the run, but the addition of “Snacks” Harrison this week should help that.",
    "stoneclosest": "",
    "calkinsscore": "27-21 Seahawks",
    "calkinscommentary": "The Seahawks have looked good for four games in a row, following up a two-point loss to the Rams with a 24-point walloping of the Raiders. Given the improvements Seattle has made on the offensive line and its running game, not to mention that Detroit's defensive line has struggled, the Seahawks should pull out this road win.",
    "calkinsclosest": "",
    "celebscore": "24-17 Seahawks",
    "celebcommentary": "Well-rested Seahawks will take to the air and pluck the lumbering Lions' mangy manes.",
    "celebname": "Daniel James Brown",
    "celebbio": "Author of The Boys in the Boat, Redmond resident",
    "celebclosest": "x"
  },
  {
    "title": "Week 9",
    "week": "Week 9",
    "date": "Sunday, Nov. 4",
    "time": "1:05 p.m.",
    "tv": "CBS",
    "location": "CenturyLink Field",
    "finalwinner": "Chargers 25",
    "finalloser": "Seahawks 17",
    "ot": "",
    "condottascore": "27-23 Seahawks",
    "condottacommentary": "The Chargers will present the best test yet for Seattle’s defense other than the Rams. And like that game, it won’t be a surprise if this one is high-scoring --- these are two really similar defenses in terms of schemes and there won’t be a lot of fooling anybody going on out there. But the Seahawks seem to be finding their formula for success, one that is always that much more potent at home.",
    "condottaclosest": "",
    "vorelscore": "27-24 Chargers",
    "vorelcommentary": "The Seahawks and Chargers are both rolling. Seattle has won four of its last five, while Los Angeles has won four straight and are coming off a bye. Philip Rivers leads one of the most complete, balanced offenses in the NFL. They'll have to score early and often to overcome the Seahawks' physical rushing attack. The Chargers will do just enough to earn a road win.",
    "vorelclosest": "x",
    "stonescore": "28-24 Seahawks",
    "stonecommentary": "The Chargers are a formidable foe, with their only losses coming against the 8-0 Rams and 7-1 Chiefs. On the other hand, they haven’t yet beaten a team with a winning record. The Seahawks are on a roll, offensively and defensively, and they’ll keep it going at home against the Chargers.",
    "stoneclosest": "",
    "calkinsscore": "24-23 Seahawks",
    "calkinscommentary": "Put these guys on a neutral field and I’m taking the Chargers, who are watching Philip Rivers having one of the best years of his potential Hall-of-Fame career. But given the advantage CenturyLink Field provides — combinied with the fact that the Seahawks’ defense, running game and passing efficiency is now near the top of the league, and the choice is Seattle in a squeaker.",
    "calkinsclosest": "",
    "celebscore": "134-12 Seahawks",
    "celebcommentary": "This town is only big enough for one famous Rivers at a time and Seattle hates anything related to Lightning or Thunder. Seahawks crush Philip's dreams and then we all party at my show Sunday, Nov. 4th at Tacoma Comedy Club.",
    "celebname": "Andrew J. Rivers",
    "celebbio": "\"Super Famous Comedian,\" Seattle-based",
    "celebclosest": ""
  },
  {
    "title": "Week 10",
    "week": "Week 10",
    "date": "Sunday, Nov. 11",
    "time": "1:25 p.m.",
    "tv": "CBS",
    "location": "Los Angeles",
    "finalwinner": "Rams 36",
    "finalloser": "Seahawks 31",
    "ot": "",
    "condottascore": "34-20 Rams",
    "condottacommentary": "The Seahawks are just about playing playoff games from here on out if they actually want to make the playoffs. But the Rams can match that sense of urgency in a year when they are in a Super Bowl-or-bust-mode, having just lost their first game of the season to the Saints. The Rams will also want to show that the first game of the season against Seattle was maybe closer than it should have been. And then there are Seattle's injuries (Bradley McDougald, D.J. Fluker, Chris Carson). This just seems like a tough one for Seattle to pull off.",
    "condottaclosest": "x",
    "vorelscore": "41-24 Rams",
    "vorelcommentary": "The Rams have one of the best offenses in the NFL, and they’re angry, rebounding from their first loss of the season in New Orleans. And, considering their first meeting with the Seahawks this season, they won’t be taking the visitors lightly on Sunday afternoon. The Seahawks, meanwhile, are nursing a number of worrisome injuries to key contributors like running back Chris Carson, safety Bradley McDougald and right guard D.J. Fluker. It’s a very realistic possibility that the starters in the Seahawks’ secondary on Sunday will be all first- or second-year players. That doesn’t add up to an upset. The Rams win big.",
    "vorelclosest": "",
    "stonescore": "38-18 Rams",
    "stonecommentary": "It won’t be as bad as the 42-7 Rams’ rout last December at CenturyLink, but nor will it be as close as the 33-31 squeaker in Seattle last month. The Rams are proving to be the most talented team in the NFC, and last week’s loss to New Orleans will only add to their motivation. Seattle rarely loses in double-digits under Pete Carroll, but with a few key injuries to deal with, they’re susceptible to a rare decisive loss.",
    "stoneclosest": "",
    "calkinsscore": "23-21 Seahawks",
    "calkinscommentary": "There’s no real reason to trust my coworkers with predictions, even if Vorel has been perfect so far. His rookie hot streak will end Sunday, as the Seahawks launch themselves back into the playoff race with their biggest upset since Russell Wilson joined the team.",
    "calkinsclosest": "",
    "celebscore": "27-21 Seahawks",
    "celebcommentary": "Seahawks will win with Russell Wilson's good arm and great feet. The Rams will lose because the toughest guy on their team is named Gurley.",
    "celebname": "Danny Bonaduce",
    "celebbio": "Host of the KZOK 102.5 morning show, star of The Partridge Family",
    "celebclosest": ""
  },
  {
    "title": "Week 11",
    "week": "Week 11",
    "date": "Thursday, Nov. 15",
    "time": "5:20 p.m.",
    "tv": "FOX/NFL Network",
    "location": "CenturyLink Field",
    "finalwinner": "Seahawks 27",
    "finalloser": "Packers 24",
    "ot": "",
    "condottascore": "27-17 Seahawks",
    "condottacommentary": "The Seahawks have been the kings of prime time under Pete Carroll, and while Sunday's loss to the Rams was a tough one to take, another effort like that would be good enough to beat Green Bay, especially with the Packers having to travel a long way on a short week. But Seattle's run defense has to start getting better.",
    "condottaclosest": "",
    "vorelscore": "28-24 Seahawks",
    "vorelcommentary": "The team that runs the ball more effectively should have an edge in Thursday’s game. The Seahawks lead the NFL in rushing yards per game, while the Packers are tied for the league-lead with 5.2 yards per carry. Oh, and expect Russell Wilson and Aaron Rodgers to make a few plays of their own. The Seahawks haven’t forced a turnover in their last two games. That streak will snap on Thursday and the shaky Seattle defense will do just enough to earn a home win.",
    "vorelclosest": "x",
    "stonescore": "22-19 Seahawks",
    "stonecommentary": "One thing you know when the Packers come to town is that something weird and memorable will happen. But all the Seahawks want is for a victory to happen; it’s almost essential to maintain their playoff hopes. These are two evenly matched teams, but I’ll give Seattle the slightest edge based on playing at home – though that hasn’t helped them too much lately.",
    "stoneclosest": "",
    "calkinsscore": "24-21 Seahawks",
    "calkinscommentary": "I agree with Pete Carroll that the Seahawks are better than their record indicates, even if they've lost their ability to close out the close ones. I also know that when the lights are on, Seattle tends to play its best. Look for the running game flourish as the Seahawks control the tempo and keep their postseason hopes alive.",
    "calkinsclosest": "",
    "celebscore": "27-21 Seahawks",
    "celebcommentary": "The Seahawks’ home field advantage will be too much for the Packers. 12s!",
    "celebname": "Staff Sgt. Ronald Shurer",
    "celebbio": "Medal of Honor recipient, Puyallup native",
    "celebclosest": ""
  },
  {
    "title": "Week 12",
    "week": "Week 12",
    "date": "Sunday, Nov. 25",
    "time": "10 a.m.",
    "tv": "FOX",
    "location": "Carolina",
    "finalwinner": "Seahawks 30",
    "finalloser": "Panthers 27",
    "ot": "",
    "condottascore": "27-24 Seahawks",
    "condottacommentary": "If this is Carolina, then the Seahawks must be going there for what feels like their annual trip to Charlotte. Seattle actually has played three games in the regular season there in the Russell Wilson era, all three times coming away with tight wins that proved pivotal. Maybe the fourth time will remain the charm? The Seahawks seem to be further forging their identity each week and can take another step toward showing they are indeed retooling rather than rebuilding.",
    "condottaclosest": "x",
    "vorelscore": "28-24 Panthers",
    "vorelcommentary": "It’s true, the Panthers have lost two straight. It’s also true that they’re 5-0 at home this season and tout one of the premier rushing offenses in the NFL. The Seahawks have struggled to put together four quarters of sustained defense and haven’t forced a turnover in their last three games. With NFC playoff hopes hanging in the balance, the Panthers will outlast the Seahawks in Charlotte.",
    "vorelclosest": "",
    "stonescore": "23-20 Seahawks",
    "stonecommentary": "The Panthers have lost two in a row, including an excruciating loss to the Lions last week. The Seahawks seem to be getting more comfortable with their identity by the week. Cam Newton presents unique challenges, but the Seahawks have won five of their last seven against Carolina and will prevail in a close one, as most of their games against the Panthers seem to be.",
    "stoneclosest": "",
    "calkinsscore": "24-20 Panthers",
    "calkinscommentary": "I think this would be the Seahawks most impressive win of the year, but the fact is they haven’t beaten a team currently above .500, and Carolina is unbeaten at home. Until the Seahawks do it, I’m picking against them.",
    "calkinsclosest": "",
    "celebscore": "(K)9-0 Seahawks",
    "celebcommentary": "<div style=\"position: relative; display: block; max-width: 300px;\"><div style=\"padding-top: 200%;\"><iframe src=\"//players.brightcove.net/1509317113/default_default/index.html?videoId=5970157959001\" \nallowfullscreen \nwebkitallowfullscreen \nmozallowfullscreen \nallow=\"encrypted-media\" \nstyle=\"position: absolute; top: 0px; right: 0px; bottom: 0px; left: 0px; width: 100%; height: 100%;\"></iframe></div></div><p><a href=\"https://www.seattletimes.com/sports/seahawks/watch-our-adorable-guest-picker-zoe-the-corgi-predicts-a-seahawks-win-over-the-panthers/\"><b>View video in larger player »</b></a></p>",
    "celebname": "Zoe the Corgi",
    "celebbio": "Unofficial Seattle Times mascot, 12th Dog",
    "celebclosest": ""
  },
  {
    "title": "Week 13",
    "week": "Week 13",
    "date": "Sunday, Dec. 2",
    "time": "1:25 p.m.",
    "tv": "FOX",
    "location": "CenturyLink Field",
    "finalwinner": "Seahawks 43",
    "finalloser": "49ers 16",
    "ot": "",
    "condottascore": "31-13 Seahawks",
    "condottacommentary": "The 49ers are reeling and turnover-prone, with a rookie quarterback making just his fourth career start. Seattle is riding high after the two huge wins the last two weeks made the playoffs begin to look like a high probability. That should add all up to one of Seattle's more comfortable wins of the season.",
    "condottaclosest": "x",
    "vorelscore": "27-16 Seahawks",
    "vorelcommentary": "I don’t think this game will be the blowout that many probably expect. Remember, the Seahawks rank dead last in the NFL in opponent yards per carry (5.3), and 49ers running back Matt Breida is averaging 5.8 yards per carry all by himself. Even with an undrafted rookie quarterback in Nick Mullens, San Francisco will move the football in Seattle. But Russell Wilson, the Seahawks’ potent rushing attack and a few timely turnovers will be too much for the 49ers to overcome.",
    "vorelclosest": "",
    "stonescore": "28-10 Seahawks",
    "stonecommentary": "The letdown factor is real, but I don’t think that’s likely with Richard Sherman on the field for San Francisco. After a gauntlet of playoff-caliber opponents, the steadily improving Seahawks will use this breather to coast to victory.",
    "stoneclosest": "",
    "calkinsscore": "31-13 Seahawks",
    "calkinscommentary": "I don't feel comfortable agreeing with Vorel, who has bombed on his last two predictions after bragging of his perfection, but this one's a given. The Seahawks are the home team, the motivated team, and the better team. The Niners are just bad. Not a lot to think about. Look for Seattle to inch closer to a postseason return.",
    "calkinsclosest": "x",
    "celebscore": "306-3 Seahawks",
    "celebcommentary": "The Seattle Seahawks will beat the Bay Area 49ers by a score of 306 to 3. The score is a lopsided record because at this point in the season, the 49ers are completely exhausted from the numerous 100 mile round trips that they’ve had to take to get to their home stadium in Santa Clara. Yes, the San Francisco 49ers play their home games 50 miles away from their, you know, home.",
    "celebname": "Joel McHale",
    "celebbio": "Actor, comedian, Seattle native and University of Washington alum",
    "celebclosest": ""
  }
]